
<title>Error F.A.Q | Jantugei Inc</title>
<link rel="icon" href="https://jantugei.ru/images/sign_logo.png">
<head>
<link rel="stylesheet" type="text/css" href="https://jantugei.ru/style/style.css">
<link rel="stylesheet" href="https://jantugei.ru/font-awesome/css/font-awesome.min.css">
</head>

    <center>
        <div style="width:55%; -webkit-box-sizing: content-box; -moz-box-sizing: content-box; box-sizing: content-box;" class="auth">
            <div style="width:100%; -webkit-box-sizing: content-box; -moz-box-sizing: content-box; box-sizing: content-box;" class="auth_label">
                <img style="height: 150px; width: 50%;" src="https://flxrenciaincorporated.com/style/sign_logo.png" alt="Flxrencia Inc">
            </div>
            <h4 style="color:#ffffff;">Вы просматриваете информацию об ошибках формы администраторов.<br>На этой странице вы сможете найти разъяснение каждой ошибки по коду и то, как ее можно решить.</h4>
            <h4 style="color:#ffffff; font-size:14px; font-weight:normal; line-height: 1.5; text-align:left;">
            201. Пользователь не заполнил одно из обязательных полей, требуемых для заполнения формы. Просьба пользователя проверить были ли заполнены ВСЕ поля.<br>
            202. Пользователь с этим ником или вк уже внесен в базу данных. Вам нужно проверить внесен ли пользователь, если это так, то вам нужно снести ему доступ.<br>
            203. Произошла ошибка со стороны базы данных при внесении пользователя, в таком случае вам нужно сообщить ГСам, они передадут информацию разработчикам.<br>
            204. Ник-нейм в поле формы не был введен по шаблону Имя_Фамилия на английском, просьба пользователя проверить нет ли там лишних символов.<br>
            205. В поле ник-нейма в форме были найдены цифры, их обязательно нужно убрать.<br>
            206. Возраст в поле формы был указан не цифрами, он обязательно должен быть указан цифрами.<br>
            207. В поле дискорда возникла ошибка, вероятнее всего пользователь не ввел дискорд тег [#6666], требуется указать дискорд по примеру: kill me, flxrencia#6666<br>
            208. Пользователю нужно указать ссылку на свой форумный аккаунт, именно на форумный аккаунт, а не на настройки.<br>
            209. При получении айди аккаунта произошла ошибка. Скажите пользователю повторить попытку через 1-2 минуты, в ином случае обновите его аккаунт в логах.<br>
            210. Произошла ошибка при получении айди пользователя в логах. Пользователь должен повторить попытку в течении 1-2 минут.<br>
            211. При получении Discord ID возникла ошибка. Вероятнее всего пользователя нет в вашем дискорд сервере, пригласите его, иначе поможет смена ника в дискорде.<br>
            212. При получении пола и имени в вк возникла ошибка. Повторите попытку через 1-2 минуты, иначе напишите ГСам, они передадут информацию разработчикам.<br>
            213. Произошла ошибка при выборе должности. Пользователь выбрал должность ГСА вместо ЗГСа. Проверьте, возможно вы допустили ошибку при выдаче, если это так воспользуйтесь +formremove.<br>
            214. Произошла ошибка при выборе структуры. Пример: Пользователь выбрал Гос вместо Гетто. Проверьте, возможно вы допустили ошибку при выдаче, если это так воспользуйтесь +formremove.<br>
            215. При получении IP адресов из логов возникла ошибка. Повторите попытку через 1-2 минуты, иначе пишите ГСам и они передадут информацию разработчикам.<br>
            216. Пользователь указал свой префикс с "|". Заполнять нужно без какого либо делителя.<br>
            217. Уровень администратора должен быть указан цифрой и уровнем от 1 по 7.<br>
            218. ID скина должен быть указан цифрой и уровнем от 1 по 311.<br>
            219. Пользователь следящий за гос не выбрал подконтрольную структур(у/ы) и его доступ ниже ПГСа, выберите подконтрольную структуру.<br>
            220. При получении IP адресов из логов возникла ошибка. Повторите попытку через 1-2 минуты, иначе сразу писать разработчикам, непонятно происхождение ошибки и ее фикс.<br>
            </h4>
            <h4 style="color:#ffffff; font-size:14px; font-weight:bold;">Если пользователь после авторизации на сайте, видит надпись "Вам не требуется заполнение этой формы!", попросите пользователя нажать кнопку выйти сверху справа.<br>Если же у него не заполняется форма либо проблема с авторизацией - попросите его заполнить с другого браузера/устройства.</h4>
        </div>
    </center>
    